Revit 2026 API

# BuiltInFailuresHostObjFailures Class

---

Failures about HostObj.

SystemObject Autodesk.Revit.DBBuiltInFailuresHostObjFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class HostObjFailures
```
```vb
Public NotInheritable Class HostObjFailures
```
```cpp
public ref class HostObjFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type HostObjFailures = class end
```

The BuiltInFailuresHostObjFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HostMismatch | Can't use this type in this host. |
|  | ReferencesNulled | One or more references are or have become invalid. |

#### Reference

Autodesk.Revit.DB Namespace